class GroupDetailMide6 {
  //มีลักษณะการพูดที่ผิดปกติ
  static List<String> speakingWrong = [
    '- พูดคนเดียวไปเรื่อยๆ',
    '- เปลี่ยนเรื่องพูดไปเรื่อยๆ โดยเนื้อหาไม่มีความสัมพันธ์กัน',
    '- พูดมากหรือพูดเร็วกว่าปกติ'
  ];
  //มีลักษณะการแต่งกายที่ผิดปกติ
  static List<String> dressingWrong = [
    "- สวมเสื้อผ้าที่สกปรกโดยไม่ยอมเปลี่ยน หรือ\n   เปลี่ยนเสื้อผ้าใหม่วันละหลายครั้ง",
    "- ไม่สนใจความสะอาดของร่างกาย เช่น ไม่อาบน้ำ ปล่อยให้\n   หนวดเครา หรือ ผมเผ้ารุงรังสกปรก มีคราบไคลตามตัว\n   หรืออาบน้ำบ่อยผิดปกติ",
    "- แก้ผ้าในที่สาธารณะ"
  ];
  //มีพฤติกรรมก้าวร้าว วุ่นวาย ทำร้ายผู้อื่น
  static List<String> aggressiveWrong = [
    "- อาละวาด",
    "- ทำลายข้าวของ",
    "- ทำร้ายผู้อื่นโดยไม่มีเหตุผล"
  ];
  //มีพฤติกรรมแยกตัวออกจากสังคม
  static List<String> separate = [
    "- เก็บตัวอยู่แต่ในห้อง",
    "- แยกตัวเองอยู่คนเดียว ไม่สุงสิงกับใคร"
  ];
  //มีอาการหวาดระแวงโดยไม่มีเหตุผล
  static List<String> suspiciously = [
    "- หวาดระแวงกลัวคนจะมาปองร้ายหรือทำร้าย",
    "- คิดว่าตนเองกำลังถูกกลั่นแกล้งหรือถูกจับผิด",
    "- ระแวงว่ามีคนคอยติดตาม",
    "- คิดว่ามีอำนาจบางอย่างมาบังคับขืนใจ",
    "- คิดว่าคนรอบข้างมักนินทาหรือพูดถึงตนเอง",
    "- มีความเชื่อโดยไม่มีเหตุผล",
    "- สะสมอาวุธไว้ป้องกันตัวจากความระแวง"
  ];
  //มีอาการหลงผิด หรือ สำคัญตนเองผิด
  static List<String> delusion = [
    "- คิดว่าตนเองเป็นผู้วิเศษ มีอิทธิฤทธิ์\n   (พิสูจน์ไม่ได้ด้วยวิธีการทางวิทยาศาสตร์)",
    "- คิดว่าตนเองร่ำรวย แจกจ่ายเงินทองให้ผู้อื่นโดยไม่มี\n   เหตุผลอันสมควร",
    "- คิดว่าตนเองเป็นบุคคลสำคัญมีความสัมพันธ์กับผู้สูงศักดิ์\n   โดยขัดจากความเป็นจริง"
  ];
  //มีอาการหูแว่ว หรือ เห็นภาพหลอน
  static List<String> scare = [
    "- ได้ยินเสียงโดยไม่เห็นตัวตนผู้พูด หรือ ได้ยินเสียงเพียง\n  คนเดียว",
    "- เห็นภาพที่คนอื่นมองไม่เห็น",
    "- พูดคนเดียวเหมือนกับโต้ตอบใคร",
    "- ทำตามเสียงแว่วที่สั่ง"
  ];
  //มีพฤติกรรมอื่นที่ผิดปกติจากคนทั่วไป
  static List<String> disorders = [
    "- หัวเราะหรือร้องไห้โดยไม่มีเหตุผล",
    "- อารมณ์เปลี่ยนไปมา",
    "- กราบไหว้บ่อยโดยไม่มีเหตุผล",
    "- เก็บสะสมสิ่งของที่ไม่มีประโยชน์ เช่น เศษขยะ\n   เศษกระป๋อง เศษขวด ฯลฯ"
  ];
}
